# Getting and Knowing Data

In [2]:
import pandas as pd
import numpy as np

## Step 1: Import Dataset

In [3]:
df = pd.read_csv("chipotle.tsv", sep = "\t")

In [4]:
# Return the first N lines
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

## Step 2: Dataset Overview

In [5]:
# Return a tuple (The number of rows, The numbers of column)
df.shape

(4622, 5)

In [6]:
# Retun the column details
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [7]:
# Print all column name
list(df.columns)

['order_id', 'quantity', 'item_name', 'choice_description', 'item_price']

In [8]:
# Index of rows
df.index

RangeIndex(start=0, stop=4622, step=1)

In [15]:
# Giá trị trung bình (mean), độ lệch chuẩn (std), giá trị nhỏ nhất (min), giá trị lớn nhất (max), các phân vị (percentiles) như 25%, 50%, 75%
# Độ lệch chuẩn (Standard Deviation) là một chỉ số thống kê đo lường mức độ phân tán hoặc biến động của dữ liệu so với giá trị trung bình (mean).
# Phân vị 25% (Q1): Là giá trị dưới đó có 25% dữ liệu. Nói cách khác, 25% các giá trị trong tập dữ liệu nằm dưới giá trị này.
# df.describe()
df.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

### loc vs iloc (Location vs Index Location)

In [16]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [28]:
df.loc[(df.quantity >= 10) & (df.item_name == "Nantucket Nectar"), ['order_id', 'quantity', 'item_name']]

Empty DataFrame
Columns: [order_id, quantity, item_name]
Index: []